StanfordAiClass.org
* Stanford CS221: Introduction to Artificial Intelligence
** Class: Overview of AI, Search
   SCHEDULED: <2011-10-10 Mon>
** Assignment 1
   DEADLINE: <2011-10-16 Sun>
** Class: Statistics, Uncertainty, and Bayes networks
   SCHEDULED: <2011-10-17 Mon>
** Assignment 2
   DEADLINE: <2011-10-23 Sun>
** Class: Machine Learning
   SCHEDULED: <2011-10-24 Mon>
** Assignment 3
   DEADLINE: <2011-10-30 Sun>
** Class: Hidden Markov models and Bayes filters
   SCHEDULED: <2011-10-31 Mon>
** Assignment 4
   DEADLINE: <2011-11-07 Mon>
** Class: Markov Decision Processes and Reinforcement Learning
   SCHEDULED: <2011-11-07 Mon>
** Assignment 5
   DEADLINE: <2011-11-13 Sun>
** Class: Adversarial planning (games) and belief space planning (POMDPs)
   SCHEDULED: <2011-11-14 Mon>
** Midterm Exam
   DEADLINE: <2011-11-20 Sun>
** Class: Logic and Logical Problem Solving
   SCHEDULED: <2011-11-21 Mon>
** Assignment 6
   DEADLINE: <2011-11-27 Sun>
** Class: Image Processing and Computer Vision
   SCHEDULED: <2011-11-28 Mon>
** Assignment 7
   DEADLINE: <2011-12-04 Sun>
** Class: Robotics and robot motion planning
   SCHEDULED: <2011-12-05 Mon>
** Assignment 8
   DEADLINE: <2011-12-11 Sun>
** Class: Natural Language Processing and Information Retrieval
   SCHEDULED: <2011-12-12 Mon>
** Final Exam
   DEADLINE: <2011-12-18 Sun>
